import math
#Задание к теме 6, задача 1
print ("Задача 1","\nВведите значение A: ",)
A = int (input())
print ("Введите значение B: ")
B = int (input())
A, B = B, A
print ("Значение A: ", A, "\nЗначение B: ", B)

#задача 2

print ("\nЗадача 2", "\nВведите значение A: ",)
A = int (input())
print ("Введите значение B: ")
B = int (input())
print ("Введите значение С: ")
C = int (input())
A, B, C = B, C, A
print ("Значение A: ", A, "\nЗначение B: ", B, "\nЗначение B: ", C)

#задача 3

print ("\nЗадача 3", "\nВведите значение A: ",)
A = int (input())
print ("Введите значение B: ")
B = int (input())
print ("Введите значение С: ")
C = int (input())
A, B, C = C, A, B
print ("Значение A: ", A, "\nЗначение B: ", B, "\nЗначение B: ", C)

#задача 4

print ("\nЗадача 4", "\nВведите значение x: ",)
x = int (input())
print ("Значение функции y = 3x^6-6x^2-7 =", 3*(x**6)-6*(x**2)-7)

#задача 5

print ("\nЗадача 5", "\nВведите значение x: ",)
x = int (input())
print ("Значение функции y = 4(x-3)^6-7(x-3)^3+2 =", 4*((x-3)**6)-7*((x-3)**3)+2)

#задача 6

print ("\nЗадача 6", "\nВведите значение A: ",)
A = float(input())
B = pow(A, 2)
A = B*B*B
print("Значение A^8 =", A)

#задача 7

print ("\nЗадача 7", "\nВведите значение A: ",)
A = float(input())
B = A*A #вторая степень
C = B*A #третья степень
C = C*B #пятая степень
B = C*C #десятая степень
A = B*C #пятнадцатая степень
print("Значение A^15 =", A)
